#+PROPERTY: header-args: :results output :exports both

* =tmux=: terminal multi-plexer

** Configuration files

   #+begin_src bash
     ls *.conf
   #+end_src

   #+RESULTS:
   : tmux.conf


** Install dotfiles
   
   *WARN*: You must use absolute paths when using symbolic links,
   otherwise =tmux= won't like it:

   #+begin_src bash
     ln -sfv "${PWD}"/tmux.conf "${HOME}"/.tmux.conf
   #+end_src

   #+RESULTS:
   : /Users/pgpb.padilla/.tmux.conf -> /Users/pgpb.padilla/dotfiles/tmux/tmux.conf


** Plugings

   The current configuration loads a couple of plugins, the most
   important ones are:

   1. [[TPM]]: a plugin to manage =tmux= plugins
      *WARN*: Must be installed before any of the other plugins work  
   2. =sensible=: common /sensible/ defaults for =tmux=
   3. =continuum=: automatically save and restore sessions
      Depends on: 
      - =resurrect=: save and restore =tmux= sessions

   #+begin_src bash :results output
     grep "'tmux-plugins" tmux.conf
   #+end_src

   #+RESULTS:
   : set -g @plugin 'tmux-plugins/tpm'
   : set -g @plugin 'tmux-plugins/tmux-sensible'
   : set -g @plugin 'tmux-plugins/tmux-resurrect'
   : set -g @plugin 'tmux-plugins/tmux-continuum'


   Take a look at the config file for more details: [[file+emacs:tmux.conf][tmux.conf]]
   
** Bookmarks                                                       :bookmark:
   
   1. =tmux= Cheat Sheet - [[https://tmuxcheatsheet.com/][tmuxcheatsheet.com]]
   2. <<TPM>>: Tmux Plugin Manager - [[https://github.com/tmux-plugins/tpm][github: tmux-plugins/tpm]]
   3. =tmux-continuum= - [[https://github.com/tmux-plugins/tmux-continuum][github: tmux-plugins/tmux-continuum]]
      Automatically save/restore your =tmux= sessions
